app/views/notes/_form.html.erb

        <option disabled></option>
        <% Band.all.each do |band| %>
            <option disabled>-- <%= band.name.upcase %> --</option>
            <% band.albums.each do |album| %>
                <option disabled>-- <%= album.title %> --</option>
                <% album.tracks.each do |track| %>
---
SELECT "bands".* FROM "bands"
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 3]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 1]]