app/views/tracks/_form.html.erb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" INNER JOIN "albums" ON "bands"."id" = "albums"."band_id" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
<% album_id = (track.persisted? ? track.album.id : params[:album_id].to_i) %>
<% band_id = (track.persisted? ? track.band.id : (params[:album_id] ? Album.find(params[:album_id]).band.id : nil)) %>

SELECT "bands".* FROM "bands"
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 3]]
---
        <option disabled></option>
        <% Band.all.each do |band| %>
            <option disabled>-- <%= band.name.upcase %> --</option>
            <% band.albums.each do |album| %>