app/views/albums/_form.html.erb

        <option disabled selected>-- select a band --</option>
        <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"