app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Dark Side of the Moon"], ["year", 1973], ["band_id", 3], ["created_at", "2019-04-23 03:57:30.881462"], ["updated_at", "2019-04-23 03:57:30.881462"]]
---
    def create
        @album = Album.new(album_params)
        if @album.save