app/controllers/notes_controller.rb

INSERT INTO "notes" ("user_id", "track_id", "note_text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["track_id", 3], ["note_text", "fa"], ["created_at", "2019-04-23 04:44:05.690450"], ["updated_at", "2019-04-23 04:44:05.690450"]]
---
    def create
        @note = current_user.notes.new(note_params)
        if @note.save!

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def current_note
        @note ||=
        Note.find(params[:id])