app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["album_id", 1], ["title", "Speak to Me"], ["ord", 1], ["lyrics", ""], ["created_at", "2019-04-23 04:18:21.506550"], ["updated_at", "2019-04-23 04:18:21.506550"]]
---
    def create
        @track = Track.new(track_params)
        if @track.save!

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "ahdsuhsaud\r\ndhasuisadhui\r\ndashoui"], ["updated_at", "2019-04-23 05:01:02.163018"], ["id", 3]]
---
    def update
        @track = Track.find(params[:id])
        if @track.update_attributes(track_params)